In [ ]:
# python 노트정리 : 2022-12

In [1]:
pip install click
# 와 터미널에서 해도 되는건데 나 바보네

Collecting click
  Downloading click-8.1.3-py3-none-any.whl (96 kB)
     ---------------------------------------- 96.6/96.6 kB ? eta 0:00:00
Requirement already satisfied: colorama in c:\programdata\anaconda3\envs\py38\lib\site-packages (from click) (0.4.6)
Installing collected packages: click
Successfully installed click-8.1.3

숫자 : 이 파일에서의 에러 갯수  
M : 수정됨  
D : 삭제됨 (git 항목에서 표시)  
U : 추적되지 않음(git 항목에서 표시)

In [8]:
from datetime import datetime

In [9]:
datetime.now()

datetime.datetime(2022, 12, 27, 9, 48, 10, 982549)

In [10]:
datetime.today().replace(day = 1)

datetime.datetime(2022, 12, 1, 9, 49, 4, 405392)

In [12]:
from datetime import datetime, timedelta, timezone

In [17]:
first_day = datetime.today().replace(day = 1)
first_day

datetime.datetime(2022, 12, 1, 9, 50, 30, 511869)

In [16]:
batch_month = first_day - timedelta(days = 1)
batch_month

datetime.datetime(2022, 11, 30, 9, 50, 14, 905929)

In [13]:
first_day = datetime.today().replace(day = 1)
batch_month = first_day - timedelta(days = 1)
batch_month.strftime('%Y%m')

'202211'

In [5]:
pip install pandas

Collecting pandas
  Downloading pandas-1.5.2-cp38-cp38-win_amd64.whl (11.0 MB)
     --------------------------------------- 11.0/11.0 MB 11.5 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\envs\py38\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\envs\py38\lib\site-packages (from pandas) (2022.7)
Collecting numpy>=1.20.3
  Downloading numpy-1.24.1-cp38-cp38-win_amd64.whl (14.9 MB)
     --------------------------------------- 14.9/14.9 MB 11.5 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\envs\py38\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: numpy, pandas
Successfully installed numpy-1.24.1 pandas-1.5.2
Note: you may need to restart the kernel to use updated packages.

In [6]:
DB_SETTINGS = {
    'source_db_localhost' : {
        'location' : 'localhost_source',
        'host' : "127.0.0.1",
        'port' : "5432",
        'user' : "postgres",
        'password' : "0328",
        'database' : "dvdrental",
        'engine' : 'postgre'
    }
}
DB_SETTINGS['source_db_localhost']

{'location': 'localhost_source',
 'host': '127.0.0.1',
 'port': '5432',
 'user': 'postgres',
 'password': '0328',
 'database': 'dvdrental',
 'engine': 'postgre'}

https://hyoje420.tistory.com/45
파이썬 모듈 설명

In [7]:
import psycopg2 as postgre
import pymssql as mssql
import pymysql as mysql

import pandas as pd

class DBConnector:

    def __init__(self, location, host, port, user, password, database, engine):
        self.conn_params = dict(
            host = host,
            port = port,
            user = user,
            password = password,
            database = database
        )
        # self.conn = None

    def _postgre_connect(self):
        conn = postgre.connect(**self.conn_params)
        return conn

db = DBConnector(**DB_SETTINGS['source_db_localhost'])
db._postgre_connect()

In [8]:
batch_month = '201305'

queries = {
    'read': {
        'actor': f'''
            SELECT '{batch_month}' AS YYYYMM, * 
            FROM actor 
            WHERE TO_CHAR(CAST(last_update AS DATE), 'YYYYMM') = '{batch_month}'
            ;
        ''',
        'film': f'''
            SELECT '{batch_month}' AS YYYYMM, * 
            FROM film 
            WHERE TO_CHAR(CAST(last_update AS DATE), 'YYYYMM') = '{batch_month}'
            ;
        '''}
    }

print(queries['read']['actor'])

            SELECT '201305' AS YYYYMM, *
            FROM actor
            WHERE TO_CHAR(CAST(last_update AS DATE), 'YYYYMM') = '201305'
            ;

In [9]:
cur = db._postgre_connect().cursor()
cur.execute(queries['read']['actor'])

result_all = cur.fetchall()
print(result_all[:5])

pdf = pd.DataFrame(result_all)
pdf.head()

[('201305', 1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)), ('201305', 2, 'Nick', 'Wahlberg', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)), ('201305', 3, 'Ed', 'Chase', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)), ('201305', 4, 'Jennifer', 'Davis', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)), ('201305', 5, 'Johnny', 'Lollobrigida', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000))]

        0  1         2             3                       4
0  201305  1  Penelope       Guiness 2013-05-26 14:47:57.620
1  201305  2      Nick      Wahlberg 2013-05-26 14:47:57.620
2  201305  3        Ed         Chase 2013-05-26 14:47:57.620
3  201305  4  Jennifer         Davis 2013-05-26 14:47:57.620
4  201305  5    Johnny  Lollobrigida 2013-05-26 14:47:57.620

In [10]:
pd.read_sql(queries['read']['actor'], db._postgre_connect())

C:\Users\user\AppData\Local\Temp\ipykernel_30488\1842855558.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(queries['read']['actor'], db._postgre_connect())

     yyyymm  actor_id first_name     last_name             last_update
0    201305         1   Penelope       Guiness 2013-05-26 14:47:57.620
1    201305         2       Nick      Wahlberg 2013-05-26 14:47:57.620
2    201305         3         Ed         Chase 2013-05-26 14:47:57.620
3    201305         4   Jennifer         Davis 2013-05-26 14:47:57.620
4    201305         5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
..      ...       ...        ...           ...                     ...
195  201305       196       Bela        Walken 2013-05-26 14:47:57.620
196  201305       197      Reese          West 2013-05-26 14:47:57.620
197  201305       198       Mary        Keitel 2013-05-26 14:47:57.620
198  201305       199      Julia       Fawcett 2013-05-26 14:47:57.620
199  201305       200      Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 5 columns]

In [3]:
import datetime
type([('201305', 1, 'Penelope', 'Guiness', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000)),
 ('201305', 2, 'Nick', 'Wahlberg', datetime.datetime(2013, 5, 26, 14, 47, 57, 620000))],
[('201305', 133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 1, 7, Decimal('4.99'), 117, Decimal('14.99'), 'NC-17', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Trailers'], "'chamber':1 'fate':4 'husband':11 'italian':2 'monkey':16 'moos':8 'must':13 'nigeria':18 'overcom':14 'reflect':5"),
 ('201305', 384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 1, 5, Decimal('4.99'), 49, Decimal('19.99'), 'R', datetime.datetime(2013, 5, 26, 14, 50, 58, 951000), ['Behind the Scenes'], "'australia':18 'cat':8 'drama':5 'epic':4 'explor':11 'gross':1 'moos':16 'must':13 'redeem':14 'wonder':2")])

NameError: name 'Decimal' is not defined

In [ ]:
[(), ()][()]

In [ ]:
pd.read_sql('''SELECT column_name, data_type FROM information_schema,'columns' WHERE table_name = 'actor';''', db_source._postgre_connect())

In [1]:
pdf

NameError: name 'pdf' is not defined